Tutorials-3.0.1/case-subsonic/Aco-2/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues ( volVectorFieldValue U ( 0 0 0 ) volScalarFieldValue T 289 volScalarFieldValue p 5.897e4 );

regions        ( boxToCell { box ( -1 -1 -1 ) ( 0 1  1 ) ; fieldValues ( volScalarFieldValue T 289 volScalarFieldValue p 6.897e4 ) ; } );


// ************************************************************************* //
